<a href="https://colab.research.google.com/github/SINUVMATHEW/ineedtolearn/blob/learn_py/TASK_20.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. In the data given below,
  - find the boolean mask where value is nan
  - remove the row with missing data.

In [1]:
import pandas as pd
import numpy as np
dates = pd.date_range('20210101',periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates,columns=list('ABCD'))
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
df["F"]=s1
df1=df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1
#please provide your answer below this line
d = df1.isnull()
print(d)
dd = df1.dropna(how='any')
# dd = df1.dropna(how='all', subset=['F','E']) 
dd

                A      B      C      D     F      E
2021-01-01  False  False  False  False  True  False
2021-01-02  False  False  False  False  True  False
2021-01-03  False  False  False  False  True   True
2021-01-04  False  False  False  False  True   True

Empty DataFrame
Columns: [A, B, C, D, F, E]
Index: []

2. In the data given below,fill the missing data with 20.

In [ ]:
import pandas as pd
import numpy as np
dates = pd.date_range('20210101',periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates,columns=list('ABCD'))
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
df["F"]=s1
df1=df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1
#please provide your answer below this line
df1.replace(to_replace = np.nan, value = 20)

                   A         B         C         D   F    E
2021-01-01 -0.458500 -1.351102  0.005608  0.919095 NaN  1.0
2021-01-02 -0.017434 -0.403255  1.182814  0.134596 NaN  1.0
2021-01-03  1.015563  1.409724 -2.337136 -0.864526 NaN  NaN
2021-01-04  0.149562 -1.448837 -0.458878 -0.384322 NaN  NaN

3. From the data given below,
  - break the data in to pieces from 0 t0 2 ,3 t0 7
  - concatenate the pieces.
  - concatenate the pieces along axis 1
  - label each as 'a' and 'b' respectively and perform concatenation.

In [3]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(10, 4))
df
#please provide your answer below this line
s1 = df.iloc[:3]
s2 = df.iloc[3:8]
d = pd.concat([s1,s2], axis=1)
d

          0         1         2  ...         1         2         3
0  0.693303  0.300554  0.424701  ...       NaN       NaN       NaN
1  1.050577 -1.556139  0.886954  ...       NaN       NaN       NaN
2 -0.143808 -0.139083  0.085785  ...       NaN       NaN       NaN
3       NaN       NaN       NaN  ...  0.758804 -2.092938  0.851751
4       NaN       NaN       NaN  ... -0.891489  0.530049 -0.858390
5       NaN       NaN       NaN  ...  1.904782 -0.201177  0.549733
6       NaN       NaN       NaN  ... -0.591304 -1.959291 -0.755215
7       NaN       NaN       NaN  ...  0.623021 -0.514732 -0.422355

[8 rows x 8 columns]